#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/orga_vis/snowflake_project_workspace_test/runs/run-AjNxjhuyzNSBUCQN

Waiting for the plan to start...

Terraform v1.11.0
on linux_amd64
Initializing plugins and modules...
snowflake_account_role.role: Refreshing state... [id=TEST_POC_VISEO_ROLE]
snowflake_grant_account_role.rolegrant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|ROLE|"SYSADMIN"]
snowflake_grant_account_role.grants: Refreshing state... [id="TEST_POC_VISEO_ROLE"|USER|"TERRAF_USER"]
snowflake_grant_privileges_to_account_role.executetask: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|EXECUTE TASK|OnAccount]
snowflake_database.db: Refreshing state... [id=TEST_POC_VISEO_DB]
snowflake_warehouse.warehouse: Refreshing state... [id=TEST_WH]
snowflake_grant_privileges_to_account_role.database_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE SCHEMA,MODIFY,USAGE,MONITOR|OnAccountObject|DATABASE|"TEST_POC_VISEO_DB"]
snowflake_grant_privileges_to_account_role.future_tables_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|INSERT,SELECT|OnSchemaObject|OnFuture|TABLES|InDatabase|"TEST_POC_VISEO_DB"]
snowflake_schema.bronze_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_schema.raw_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_schema.silver_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_schema.gold_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."GOLD_LAYER"]
snowflake_grant_privileges_to_account_role.warehouse_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|USAGE|OnAccountObject|WAREHOUSE|"TEST_WH"]
snowflake_grant_privileges_to_account_role.schema_grant_raw: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_bronze: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE SEQUENCE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_silver: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_gold: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."GOLD_LAYER"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # snowflake_account_role.role will be updated in-place
  ~ resource "snowflake_account_role" "role" {
      ~ fully_qualified_name = "\"TEST_POC_VISEO_ROLE\"" -> (known after apply)
        id                   = "TEST_POC_VISEO_ROLE"
      ~ name                 = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE"
      ~ show_output          = [
          - {
              - assigned_to_users = 1
              - created_on        = "2025-03-06 14:30:06.731 +0000 UTC"
              - granted_roles     = 0
              - granted_to_roles  = 1
              - is_current        = false
              - is_default        = false
              - is_inherited      = true
              - name              = "TEST_POC_VISEO_ROLE"
              - owner             = "SECURITYADMIN"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # snowflake_database.db will be updated in-place
  ~ resource "snowflake_database" "db" {
      ~ fully_qualified_name                          = "\"TEST_POC_VISEO_DB\"" -> (known after apply)
        id                                            = "TEST_POC_VISEO_DB"
      ~ name                                          = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB"
        # (18 unchanged attributes hidden)
    }

  # snowflake_grant_account_role.grants must be replaced
-/+ resource "snowflake_grant_account_role" "grants" {
      ~ id        = "\"TEST_POC_VISEO_ROLE\"|USER|\"TERRAF_USER\"" -> (known after apply)
      ~ role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # snowflake_grant_account_role.rolegrant must be replaced
-/+ resource "snowflake_grant_account_role" "rolegrant" {
      ~ id               = "\"TEST_POC_VISEO_ROLE\"|ROLE|\"SYSADMIN\"" -> (known after apply)
      ~ role_name        = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # snowflake_grant_privileges_to_account_role.database_grant must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "database_grant" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|CREATE SCHEMA,MODIFY,USAGE,MONITOR|OnAccountObject|DATABASE|\"TEST_POC_VISEO_DB\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_account_object {
          ~ object_name = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # snowflake_grant_privileges_to_account_role.executetask must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "executetask" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|EXECUTE TASK|OnAccount" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # snowflake_grant_privileges_to_account_role.future_tables_grant must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "future_tables_grant" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|INSERT,SELECT|OnSchemaObject|OnFuture|TABLES|InDatabase|\"TEST_POC_VISEO_DB\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_schema_object {
            # (2 unchanged attributes hidden)

          ~ future {
              ~ in_database        = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB" # forces replacement
                # (2 unchanged attributes hidden)
            }
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_bronze must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "schema_grant_bronze" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE SEQUENCE,USAGE|OnSchema|OnSchema|\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_schema {
          ~ schema_name                = "\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\"" -> "\"test_POC_VISEO_DB\".\"BRONZE_LAYER\"" # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_gold must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "schema_grant_gold" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_schema {
          ~ schema_name                = "\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\"" -> "\"test_POC_VISEO_DB\".\"GOLD_LAYER\"" # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_raw must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "schema_grant_raw" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|\"TEST_POC_VISEO_DB\".\"RAW_LAYER\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_schema {
          ~ schema_name                = "\"TEST_POC_VISEO_DB\".\"RAW_LAYER\"" -> "\"test_POC_VISEO_DB\".\"RAW_LAYER\"" # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant_silver must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "schema_grant_silver" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|CREATE TASK,CREATE STREAM,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,USAGE|OnSchema|OnSchema|\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_schema {
          ~ schema_name                = "\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\"" -> "\"test_POC_VISEO_DB\".\"SILVER_LAYER\"" # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # snowflake_grant_privileges_to_account_role.warehouse_grant must be replaced
-/+ resource "snowflake_grant_privileges_to_account_role" "warehouse_grant" {
      ~ account_role_name = "TEST_POC_VISEO_ROLE" -> "test_POC_VISEO_ROLE" # forces replacement
      ~ id                = "\"TEST_POC_VISEO_ROLE\"|false|false|USAGE|OnAccountObject|WAREHOUSE|\"TEST_WH\"" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ on_account_object {
          ~ object_name = "TEST_WH" -> "test_WH" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # snowflake_schema.bronze_layer must be replaced
-/+ resource "snowflake_schema" "bronze_layer" {
      + catalog                                       = (known after apply)
      ~ data_retention_time_in_days                   = 1 -> (known after apply)
      ~ database                                      = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB" # forces replacement
      + default_ddl_collation                         = (known after apply)
      ~ describe_output                               = [] -> (known after apply)
      ~ enable_console_output                         = false -> (known after apply)
      + external_volume                               = (known after apply)
      ~ fully_qualified_name                          = "\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\"" -> (known after apply)
      ~ id                                            = "\"TEST_POC_VISEO_DB\".\"BRONZE_LAYER\"" -> (known after apply)
      ~ log_level                                     = "OFF" -> (known after apply)
      ~ max_data_extension_time_in_days               = 14 -> (known after apply)
        name                                          = "BRONZE_LAYER"
      ~ parameters                                    = [
          - {
              - catalog                                       = [
                  - {
                      - description = "Name of the catalog integration to use for iceberg tables"
                      - key         = "CATALOG"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - data_retention_time_in_days                   = [
                  - {
                      - default     = "1"
                      - description = "number of days to retain the old version of deleted/updated data"
                      - key         = "DATA_RETENTION_TIME_IN_DAYS"
                      - value       = "1"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - default_ddl_collation                         = [
                  - {
                      - description = "Collation that is used for all the new columns created by the DDL statements (if not specified)"
                      - key         = "DEFAULT_DDL_COLLATION"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - enable_console_output                         = [
                  - {
                      - default     = "false"
                      - description = "Enable stdout/stderr fast path logging for anonyous stored procs. This is a public parameter (similar to LOG_LEVEL)."
                      - key         = "ENABLE_CONSOLE_OUTPUT"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - external_volume                               = [
                  - {
                      - description = "Name of an external volume that will be used for persisted Iceberg metadata and data files."
                      - key         = "EXTERNAL_VOLUME"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - log_level                                     = [
                  - {
                      - default     = "OFF"
                      - description = "LOG_LEVEL to use when filtering events"
                      - key         = "LOG_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - max_data_extension_time_in_days               = [
                  - {
                      - default     = "14"
                      - description = "Maximum number of days to extend data retention beyond the retention period to prevent a stream becoming stale."
                      - key         = "MAX_DATA_EXTENSION_TIME_IN_DAYS"
                      - value       = "14"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - pipe_execution_paused                         = [
                  - {
                      - default     = "false"
                      - description = "Pause processing of files for a pipe"
                      - key         = "PIPE_EXECUTION_PAUSED"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - quoted_identifiers_ignore_case                = [
                  - {
                      - default     = "false"
                      - description = "If true, the case of quoted identifiers is ignored"
                      - key         = "QUOTED_IDENTIFIERS_IGNORE_CASE"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - replace_invalid_characters                    = [
                  - {
                      - default     = "false"
                      - description = "Replace invalid UTF-8 characters found in Iceberg table external data files with the Unicode replacement character"
                      - key         = "REPLACE_INVALID_CHARACTERS"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - storage_serialization_policy                  = [
                  - {
                      - default     = "OPTIMIZED"
                      - description = "Storage serialization policy used for managed Iceberg table. This include encodings and compressions"
                      - key         = "STORAGE_SERIALIZATION_POLICY"
                      - value       = "OPTIMIZED"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - suspend_task_after_num_failures               = [
                  - {
                      - default     = "10"
                      - description = "How many times a task must fail in a row before it is automatically suspended. 0 disables auto-suspending."
                      - key         = "SUSPEND_TASK_AFTER_NUM_FAILURES"
                      - value       = "10"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - task_auto_retry_attempts                      = [
                  - {
                      - default     = "0"
                      - description = "Maximum Automatic Retries Allowed For A User Task"
                      - key         = "TASK_AUTO_RETRY_ATTEMPTS"
                      - value       = "0"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - trace_level                                   = [
                  - {
                      - default     = "OFF"
                      - description = "Trace level value to use when generating/filtering trace events"
                      - key         = "TRACE_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_managed_initial_warehouse_size      = [
                  - {
                      - default     = "Medium"
                      - description = "The initial size of warehouse to use for managed warehouses in the absence of history"
                      - key         = "USER_TASK_MANAGED_INITIAL_WAREHOUSE_SIZE"
                      - value       = "Medium"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_minimum_trigger_interval_in_seconds = [
                  - {
                      - default     = "30"
                      - description = "Minimum amount of time between Triggered Task executions in seconds"
                      - key         = "USER_TASK_MINIMUM_TRIGGER_INTERVAL_IN_SECONDS"
                      - value       = "30"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_timeout_ms                          = [
                  - {
                      - default     = "3600000"
                      - description = "User task execution timeout in milliseconds"
                      - key         = "USER_TASK_TIMEOUT_MS"
                      - value       = "3600000"
                        # (1 unchanged attribute hidden)
                    },
                ]
            },
        ] -> (known after apply)
      ~ pipe_execution_paused                         = false -> (known after apply)
      ~ quoted_identifiers_ignore_case                = false -> (known after apply)
      ~ replace_invalid_characters                    = false -> (known after apply)
      ~ show_output                                   = [
          - {
              - created_on      = "2025-03-06 14:30:08.848 +0000 UTC"
              - database_name   = "TEST_POC_VISEO_DB"
              - dropped_on      = "0001-01-01 00:00:00 +0000 UTC"
              - is_current      = false
              - is_default      = false
              - name            = "BRONZE_LAYER"
              - owner           = "SYSADMIN"
              - owner_role_type = "ROLE"
              - retention_time  = "1"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ storage_serialization_policy                  = "OPTIMIZED" -> (known after apply)
      ~ suspend_task_after_num_failures               = 10 -> (known after apply)
      ~ task_auto_retry_attempts                      = 0 -> (known after apply)
      ~ trace_level                                   = "OFF" -> (known after apply)
      ~ user_task_managed_initial_warehouse_size      = "Medium" -> (known after apply)
      ~ user_task_minimum_trigger_interval_in_seconds = 30 -> (known after apply)
      ~ user_task_timeout_ms                          = 3600000 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # snowflake_schema.gold_layer must be replaced
-/+ resource "snowflake_schema" "gold_layer" {
      + catalog                                       = (known after apply)
      ~ data_retention_time_in_days                   = 1 -> (known after apply)
      ~ database                                      = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB" # forces replacement
      + default_ddl_collation                         = (known after apply)
      ~ describe_output                               = [] -> (known after apply)
      ~ enable_console_output                         = false -> (known after apply)
      + external_volume                               = (known after apply)
      ~ fully_qualified_name                          = "\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\"" -> (known after apply)
      ~ id                                            = "\"TEST_POC_VISEO_DB\".\"GOLD_LAYER\"" -> (known after apply)
      ~ log_level                                     = "OFF" -> (known after apply)
      ~ max_data_extension_time_in_days               = 14 -> (known after apply)
        name                                          = "GOLD_LAYER"
      ~ parameters                                    = [
          - {
              - catalog                                       = [
                  - {
                      - description = "Name of the catalog integration to use for iceberg tables"
                      - key         = "CATALOG"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - data_retention_time_in_days                   = [
                  - {
                      - default     = "1"
                      - description = "number of days to retain the old version of deleted/updated data"
                      - key         = "DATA_RETENTION_TIME_IN_DAYS"
                      - value       = "1"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - default_ddl_collation                         = [
                  - {
                      - description = "Collation that is used for all the new columns created by the DDL statements (if not specified)"
                      - key         = "DEFAULT_DDL_COLLATION"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - enable_console_output                         = [
                  - {
                      - default     = "false"
                      - description = "Enable stdout/stderr fast path logging for anonyous stored procs. This is a public parameter (similar to LOG_LEVEL)."
                      - key         = "ENABLE_CONSOLE_OUTPUT"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - external_volume                               = [
                  - {
                      - description = "Name of an external volume that will be used for persisted Iceberg metadata and data files."
                      - key         = "EXTERNAL_VOLUME"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - log_level                                     = [
                  - {
                      - default     = "OFF"
                      - description = "LOG_LEVEL to use when filtering events"
                      - key         = "LOG_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - max_data_extension_time_in_days               = [
                  - {
                      - default     = "14"
                      - description = "Maximum number of days to extend data retention beyond the retention period to prevent a stream becoming stale."
                      - key         = "MAX_DATA_EXTENSION_TIME_IN_DAYS"
                      - value       = "14"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - pipe_execution_paused                         = [
                  - {
                      - default     = "false"
                      - description = "Pause processing of files for a pipe"
                      - key         = "PIPE_EXECUTION_PAUSED"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - quoted_identifiers_ignore_case                = [
                  - {
                      - default     = "false"
                      - description = "If true, the case of quoted identifiers is ignored"
                      - key         = "QUOTED_IDENTIFIERS_IGNORE_CASE"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - replace_invalid_characters                    = [
                  - {
                      - default     = "false"
                      - description = "Replace invalid UTF-8 characters found in Iceberg table external data files with the Unicode replacement character"
                      - key         = "REPLACE_INVALID_CHARACTERS"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - storage_serialization_policy                  = [
                  - {
                      - default     = "OPTIMIZED"
                      - description = "Storage serialization policy used for managed Iceberg table. This include encodings and compressions"
                      - key         = "STORAGE_SERIALIZATION_POLICY"
                      - value       = "OPTIMIZED"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - suspend_task_after_num_failures               = [
                  - {
                      - default     = "10"
                      - description = "How many times a task must fail in a row before it is automatically suspended. 0 disables auto-suspending."
                      - key         = "SUSPEND_TASK_AFTER_NUM_FAILURES"
                      - value       = "10"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - task_auto_retry_attempts                      = [
                  - {
                      - default     = "0"
                      - description = "Maximum Automatic Retries Allowed For A User Task"
                      - key         = "TASK_AUTO_RETRY_ATTEMPTS"
                      - value       = "0"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - trace_level                                   = [
                  - {
                      - default     = "OFF"
                      - description = "Trace level value to use when generating/filtering trace events"
                      - key         = "TRACE_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_managed_initial_warehouse_size      = [
                  - {
                      - default     = "Medium"
                      - description = "The initial size of warehouse to use for managed warehouses in the absence of history"
                      - key         = "USER_TASK_MANAGED_INITIAL_WAREHOUSE_SIZE"
                      - value       = "Medium"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_minimum_trigger_interval_in_seconds = [
                  - {
                      - default     = "30"
                      - description = "Minimum amount of time between Triggered Task executions in seconds"
                      - key         = "USER_TASK_MINIMUM_TRIGGER_INTERVAL_IN_SECONDS"
                      - value       = "30"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_timeout_ms                          = [
                  - {
                      - default     = "3600000"
                      - description = "User task execution timeout in milliseconds"
                      - key         = "USER_TASK_TIMEOUT_MS"
                      - value       = "3600000"
                        # (1 unchanged attribute hidden)
                    },
                ]
            },
        ] -> (known after apply)
      ~ pipe_execution_paused                         = false -> (known after apply)
      ~ quoted_identifiers_ignore_case                = false -> (known after apply)
      ~ replace_invalid_characters                    = false -> (known after apply)
      ~ show_output                                   = [
          - {
              - created_on      = "2025-03-06 14:30:08.352 +0000 UTC"
              - database_name   = "TEST_POC_VISEO_DB"
              - dropped_on      = "0001-01-01 00:00:00 +0000 UTC"
              - is_current      = false
              - is_default      = false
              - name            = "GOLD_LAYER"
              - owner           = "SYSADMIN"
              - owner_role_type = "ROLE"
              - retention_time  = "1"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ storage_serialization_policy                  = "OPTIMIZED" -> (known after apply)
      ~ suspend_task_after_num_failures               = 10 -> (known after apply)
      ~ task_auto_retry_attempts                      = 0 -> (known after apply)
      ~ trace_level                                   = "OFF" -> (known after apply)
      ~ user_task_managed_initial_warehouse_size      = "Medium" -> (known after apply)
      ~ user_task_minimum_trigger_interval_in_seconds = 30 -> (known after apply)
      ~ user_task_timeout_ms                          = 3600000 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # snowflake_schema.raw_layer must be replaced
-/+ resource "snowflake_schema" "raw_layer" {
      + catalog                                       = (known after apply)
      ~ data_retention_time_in_days                   = 1 -> (known after apply)
      ~ database                                      = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB" # forces replacement
      + default_ddl_collation                         = (known after apply)
      ~ describe_output                               = [] -> (known after apply)
      ~ enable_console_output                         = false -> (known after apply)
      + external_volume                               = (known after apply)
      ~ fully_qualified_name                          = "\"TEST_POC_VISEO_DB\".\"RAW_LAYER\"" -> (known after apply)
      ~ id                                            = "\"TEST_POC_VISEO_DB\".\"RAW_LAYER\"" -> (known after apply)
      ~ log_level                                     = "OFF" -> (known after apply)
      ~ max_data_extension_time_in_days               = 14 -> (known after apply)
        name                                          = "RAW_LAYER"
      ~ parameters                                    = [
          - {
              - catalog                                       = [
                  - {
                      - description = "Name of the catalog integration to use for iceberg tables"
                      - key         = "CATALOG"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - data_retention_time_in_days                   = [
                  - {
                      - default     = "1"
                      - description = "number of days to retain the old version of deleted/updated data"
                      - key         = "DATA_RETENTION_TIME_IN_DAYS"
                      - value       = "1"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - default_ddl_collation                         = [
                  - {
                      - description = "Collation that is used for all the new columns created by the DDL statements (if not specified)"
                      - key         = "DEFAULT_DDL_COLLATION"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - enable_console_output                         = [
                  - {
                      - default     = "false"
                      - description = "Enable stdout/stderr fast path logging for anonyous stored procs. This is a public parameter (similar to LOG_LEVEL)."
                      - key         = "ENABLE_CONSOLE_OUTPUT"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - external_volume                               = [
                  - {
                      - description = "Name of an external volume that will be used for persisted Iceberg metadata and data files."
                      - key         = "EXTERNAL_VOLUME"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - log_level                                     = [
                  - {
                      - default     = "OFF"
                      - description = "LOG_LEVEL to use when filtering events"
                      - key         = "LOG_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - max_data_extension_time_in_days               = [
                  - {
                      - default     = "14"
                      - description = "Maximum number of days to extend data retention beyond the retention period to prevent a stream becoming stale."
                      - key         = "MAX_DATA_EXTENSION_TIME_IN_DAYS"
                      - value       = "14"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - pipe_execution_paused                         = [
                  - {
                      - default     = "false"
                      - description = "Pause processing of files for a pipe"
                      - key         = "PIPE_EXECUTION_PAUSED"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - quoted_identifiers_ignore_case                = [
                  - {
                      - default     = "false"
                      - description = "If true, the case of quoted identifiers is ignored"
                      - key         = "QUOTED_IDENTIFIERS_IGNORE_CASE"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - replace_invalid_characters                    = [
                  - {
                      - default     = "false"
                      - description = "Replace invalid UTF-8 characters found in Iceberg table external data files with the Unicode replacement character"
                      - key         = "REPLACE_INVALID_CHARACTERS"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - storage_serialization_policy                  = [
                  - {
                      - default     = "OPTIMIZED"
                      - description = "Storage serialization policy used for managed Iceberg table. This include encodings and compressions"
                      - key         = "STORAGE_SERIALIZATION_POLICY"
                      - value       = "OPTIMIZED"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - suspend_task_after_num_failures               = [
                  - {
                      - default     = "10"
                      - description = "How many times a task must fail in a row before it is automatically suspended. 0 disables auto-suspending."
                      - key         = "SUSPEND_TASK_AFTER_NUM_FAILURES"
                      - value       = "10"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - task_auto_retry_attempts                      = [
                  - {
                      - default     = "0"
                      - description = "Maximum Automatic Retries Allowed For A User Task"
                      - key         = "TASK_AUTO_RETRY_ATTEMPTS"
                      - value       = "0"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - trace_level                                   = [
                  - {
                      - default     = "OFF"
                      - description = "Trace level value to use when generating/filtering trace events"
                      - key         = "TRACE_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_managed_initial_warehouse_size      = [
                  - {
                      - default     = "Medium"
                      - description = "The initial size of warehouse to use for managed warehouses in the absence of history"
                      - key         = "USER_TASK_MANAGED_INITIAL_WAREHOUSE_SIZE"
                      - value       = "Medium"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_minimum_trigger_interval_in_seconds = [
                  - {
                      - default     = "30"
                      - description = "Minimum amount of time between Triggered Task executions in seconds"
                      - key         = "USER_TASK_MINIMUM_TRIGGER_INTERVAL_IN_SECONDS"
                      - value       = "30"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_timeout_ms                          = [
                  - {
                      - default     = "3600000"
                      - description = "User task execution timeout in milliseconds"
                      - key         = "USER_TASK_TIMEOUT_MS"
                      - value       = "3600000"
                        # (1 unchanged attribute hidden)
                    },
                ]
            },
        ] -> (known after apply)
      ~ pipe_execution_paused                         = false -> (known after apply)
      ~ quoted_identifiers_ignore_case                = false -> (known after apply)
      ~ replace_invalid_characters                    = false -> (known after apply)
      ~ show_output                                   = [
          - {
              - created_on      = "2025-03-06 14:30:08.871 +0000 UTC"
              - database_name   = "TEST_POC_VISEO_DB"
              - dropped_on      = "0001-01-01 00:00:00 +0000 UTC"
              - is_current      = false
              - is_default      = false
              - name            = "RAW_LAYER"
              - owner           = "SYSADMIN"
              - owner_role_type = "ROLE"
              - retention_time  = "1"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ storage_serialization_policy                  = "OPTIMIZED" -> (known after apply)
      ~ suspend_task_after_num_failures               = 10 -> (known after apply)
      ~ task_auto_retry_attempts                      = 0 -> (known after apply)
      ~ trace_level                                   = "OFF" -> (known after apply)
      ~ user_task_managed_initial_warehouse_size      = "Medium" -> (known after apply)
      ~ user_task_minimum_trigger_interval_in_seconds = 30 -> (known after apply)
      ~ user_task_timeout_ms                          = 3600000 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # snowflake_schema.silver_layer must be replaced
-/+ resource "snowflake_schema" "silver_layer" {
      + catalog                                       = (known after apply)
      ~ data_retention_time_in_days                   = 1 -> (known after apply)
      ~ database                                      = "TEST_POC_VISEO_DB" -> "test_POC_VISEO_DB" # forces replacement
      + default_ddl_collation                         = (known after apply)
      ~ describe_output                               = [] -> (known after apply)
      ~ enable_console_output                         = false -> (known after apply)
      + external_volume                               = (known after apply)
      ~ fully_qualified_name                          = "\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\"" -> (known after apply)
      ~ id                                            = "\"TEST_POC_VISEO_DB\".\"SILVER_LAYER\"" -> (known after apply)
      ~ log_level                                     = "OFF" -> (known after apply)
      ~ max_data_extension_time_in_days               = 14 -> (known after apply)
        name                                          = "SILVER_LAYER"
      ~ parameters                                    = [
          - {
              - catalog                                       = [
                  - {
                      - description = "Name of the catalog integration to use for iceberg tables"
                      - key         = "CATALOG"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - data_retention_time_in_days                   = [
                  - {
                      - default     = "1"
                      - description = "number of days to retain the old version of deleted/updated data"
                      - key         = "DATA_RETENTION_TIME_IN_DAYS"
                      - value       = "1"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - default_ddl_collation                         = [
                  - {
                      - description = "Collation that is used for all the new columns created by the DDL statements (if not specified)"
                      - key         = "DEFAULT_DDL_COLLATION"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - enable_console_output                         = [
                  - {
                      - default     = "false"
                      - description = "Enable stdout/stderr fast path logging for anonyous stored procs. This is a public parameter (similar to LOG_LEVEL)."
                      - key         = "ENABLE_CONSOLE_OUTPUT"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - external_volume                               = [
                  - {
                      - description = "Name of an external volume that will be used for persisted Iceberg metadata and data files."
                      - key         = "EXTERNAL_VOLUME"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - log_level                                     = [
                  - {
                      - default     = "OFF"
                      - description = "LOG_LEVEL to use when filtering events"
                      - key         = "LOG_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - max_data_extension_time_in_days               = [
                  - {
                      - default     = "14"
                      - description = "Maximum number of days to extend data retention beyond the retention period to prevent a stream becoming stale."
                      - key         = "MAX_DATA_EXTENSION_TIME_IN_DAYS"
                      - value       = "14"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - pipe_execution_paused                         = [
                  - {
                      - default     = "false"
                      - description = "Pause processing of files for a pipe"
                      - key         = "PIPE_EXECUTION_PAUSED"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - quoted_identifiers_ignore_case                = [
                  - {
                      - default     = "false"
                      - description = "If true, the case of quoted identifiers is ignored"
                      - key         = "QUOTED_IDENTIFIERS_IGNORE_CASE"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - replace_invalid_characters                    = [
                  - {
                      - default     = "false"
                      - description = "Replace invalid UTF-8 characters found in Iceberg table external data files with the Unicode replacement character"
                      - key         = "REPLACE_INVALID_CHARACTERS"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - storage_serialization_policy                  = [
                  - {
                      - default     = "OPTIMIZED"
                      - description = "Storage serialization policy used for managed Iceberg table. This include encodings and compressions"
                      - key         = "STORAGE_SERIALIZATION_POLICY"
                      - value       = "OPTIMIZED"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - suspend_task_after_num_failures               = [
                  - {
                      - default     = "10"
                      - description = "How many times a task must fail in a row before it is automatically suspended. 0 disables auto-suspending."
                      - key         = "SUSPEND_TASK_AFTER_NUM_FAILURES"
                      - value       = "10"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - task_auto_retry_attempts                      = [
                  - {
                      - default     = "0"
                      - description = "Maximum Automatic Retries Allowed For A User Task"
                      - key         = "TASK_AUTO_RETRY_ATTEMPTS"
                      - value       = "0"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - trace_level                                   = [
                  - {
                      - default     = "OFF"
                      - description = "Trace level value to use when generating/filtering trace events"
                      - key         = "TRACE_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_managed_initial_warehouse_size      = [
                  - {
                      - default     = "Medium"
                      - description = "The initial size of warehouse to use for managed warehouses in the absence of history"
                      - key         = "USER_TASK_MANAGED_INITIAL_WAREHOUSE_SIZE"
                      - value       = "Medium"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_minimum_trigger_interval_in_seconds = [
                  - {
                      - default     = "30"
                      - description = "Minimum amount of time between Triggered Task executions in seconds"
                      - key         = "USER_TASK_MINIMUM_TRIGGER_INTERVAL_IN_SECONDS"
                      - value       = "30"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_timeout_ms                          = [
                  - {
                      - default     = "3600000"
                      - description = "User task execution timeout in milliseconds"
                      - key         = "USER_TASK_TIMEOUT_MS"
                      - value       = "3600000"
                        # (1 unchanged attribute hidden)
                    },
                ]
            },
        ] -> (known after apply)
      ~ pipe_execution_paused                         = false -> (known after apply)
      ~ quoted_identifiers_ignore_case                = false -> (known after apply)
      ~ replace_invalid_characters                    = false -> (known after apply)
      ~ show_output                                   = [
          - {
              - created_on      = "2025-03-06 14:30:08.333 +0000 UTC"
              - database_name   = "TEST_POC_VISEO_DB"
              - dropped_on      = "0001-01-01 00:00:00 +0000 UTC"
              - is_current      = false
              - is_default      = false
              - name            = "SILVER_LAYER"
              - owner           = "SYSADMIN"
              - owner_role_type = "ROLE"
              - retention_time  = "1"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ storage_serialization_policy                  = "OPTIMIZED" -> (known after apply)
      ~ suspend_task_after_num_failures               = 10 -> (known after apply)
      ~ task_auto_retry_attempts                      = 0 -> (known after apply)
      ~ trace_level                                   = "OFF" -> (known after apply)
      ~ user_task_managed_initial_warehouse_size      = "Medium" -> (known after apply)
      ~ user_task_minimum_trigger_interval_in_seconds = 30 -> (known after apply)
      ~ user_task_timeout_ms                          = 3600000 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # snowflake_warehouse.warehouse will be updated in-place
  ~ resource "snowflake_warehouse" "warehouse" {
      ~ fully_qualified_name                = "\"TEST_WH\"" -> (known after apply)
        id                                  = "TEST_WH"
      ~ name                                = "TEST_WH" -> "test_WH"
      ~ show_output                         = [
          - {
              - auto_resume                         = true
              - auto_suspend                        = 60
              - available                           = 0
              - created_on                          = "2025-03-06 14:30:06.695 +0000 UTC"
              - enable_query_acceleration           = false
              - is_current                          = false
              - is_default                          = false
              - max_cluster_count                   = 1
              - min_cluster_count                   = 1
              - name                                = "TEST_WH"
              - other                               = 0
              - owner                               = "SYSADMIN"
              - owner_role_type                     = "ROLE"
              - provisioning                        = 0
              - query_acceleration_max_scale_factor = 8
              - queued                              = 0
              - quiescing                           = 0
              - resumed_on                          = "2025-03-06 14:30:07.063 +0000 UTC"
              - running                             = 0
              - scaling_policy                      = "STANDARD"
              - size                                = "SMALL"
              - started_clusters                    = 0
              - state                               = "SUSPENDED"
              - type                                = "STANDARD"
              - updated_on                          = "2025-03-06 14:30:07.063 +0000 UTC"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 14 to add, 3 to change, 14 to destroy.


```

</details>

*Pusher: @WalidVis, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*